zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpuart_reg.h
     * |        |          |011 = RS-485 function.
     * |        |          |Others = Reserved.
     * |[3]     |TXRXDIS   |TX and RX Disable Bit
     * |        |          |Setting this bit can disable TX and RX.
     * |        |          |0 = TX and RX Enabled.
     * |        |          |1 = TX and RX Disabled.
     * |        |          |Note: The TX and RX will not be disabled immediately when this bit is set
     * |        |          |The TX and RX complete current task before TX and RX are disabled
     * |        |          |When TX and RX are disabled, the TXRXACT (LPUART_FIFOSTS[31]) is cleared.
     * |[6]     |DGE       |Deglitch Enable Bit
     * |        |          |0 = Deglitch Disabled.
     * |        |          |1 = Deglitch Enabled.
     * |        |          |Note 1: When this bit is set to logic 1, any pulse width less than about 150 ns will be considered a glitch and will be removed in the serial data input (RX).
     * |        |          |This bit acts only on RX line and has no effect on the transmitter logic.
     * |        |          |Note 2: It is recommended to set this bit only when operating at baud rate under 2.5 Mbps.
     * |[7]     |TXRXSWP   |TX and RX Swap Enable Bit
     * |        |          |Setting this bit Swaps TX pin and RX pin.
     * |        |          |0 = TX and RX Swap Disabled.
     * |        |          |1 = TX and RX Swap Enabled.
     * @var LPUART_T::BRCOMP
     * Offset: 0x3C  LPUART Baud Rate Compensation Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[8:0]   |BRCOMP    |Baud Rate Compensation Patten
     * |        |          |These 9-bits are used to define the relative bit is compensated or not.
     * |        |          |BRCOMP[7:0] is used to define the compensation of DAT (LPUART_DAT[7:0]) and BRCOM[8] is used to define PARITY (LPUART_DAT[8]).
     * |[31]    |BRCOMPDEC |Baud Rate Compensation Decrease
     * |        |          |0 = Positive (increase one module clock) compensation for each compensated bit.
     * |        |          |1 = Negative (decrease one module clock) compensation for each compensated bit.
     * @var LPUART_T::WKCTL
     * Offset: 0x40  LPUART Wake-up Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |WKCTSEN   |nCTS Wake-up Enable Bit
     * |        |          |0 = nCTS Wake-up system function Disabled.
     * |        |          |1 = nCTS Wake-up system function Enabled.
     * |        |          |Note: When the system is in Power-down mode, an external nCTS change will wake up system from Power-down mode.
     * |[1]     |WKDATEN   |Incoming Data Wake-up Enable Bit
     * |        |          |0 = Incoming data wake-up system function Disabled.
     * |        |          |1 = Incoming data wake-up system function Enabled.
     * |        |          |Note: When the system is in Power-down mode, incoming data will wake-up system from Power-down mode.
     * |[2]     |WKRFRTEN  |Received Data FIFO Reached Threshold Wake-up Enable Bit
     * |        |          |0 = Received Data FIFO reached threshold wake-up system function Disabled.
     * |        |          |1 = Received Data FIFO reached threshold wake-up system function Enabled.
     * |        |          |Note: When the system is in Power-down mode, Received Data FIFO reached threshold will wake-up system from Power-down mode.
     * |[3]     |WKRS485EN |RS-485 Address Match (AAD Mode) Wake-up Enable Bit
     * |        |          |0 = RS-485 Address Match (AAD mode) wake-up system function Disabled.
     * |        |          |1 = RS-485 Address Match (AAD mode) wake-up system function Enabled.
     * |        |          |Note 1: When the system is in Power-down mode, RS-485 Address Match will wake-up system from Power-down mode.
     * |        |          |Note 2: This bit is used for RS-485 Auto Address Detection (AAD) mode in RS-485 function mode and ADDRDEN (LPUART_ALTCTL[15]) is set to 1.
     * |[4]     |WKTOUTEN  |Received Data FIFO Reached Threshold Time-out Wake-up Enable Bit
     * |        |          |0 = Received Data FIFO reached threshold time-out wake-up system function Disabled.
     * |        |          |1 = Received Data FIFO reached threshold time-out wake-up system function Enabled.
     * |        |          |Note 1: When the system is in Power-down mode, Received Data FIFO reached threshold time-out will wake up system from Power-down mode.
     * |        |          |Note 2: It is suggested the function is enabled when the WKRFRTEN (LPUART_WKCTL[2]) is set to 1.
     * @var LPUART_T::WKSTS
     * Offset: 0x44  LPUART Wake-up Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CTSWKF    |nCTS Wake-up Flag
     * |        |          |This bit is set if chip wake-up from power-down state by nCTS wake-up.
     * |        |          |0 = Chip stays in power-down state.
     * |        |          |1 = Chip wake-up from power-down state by nCTS wake-up.
     * |        |          |Note 1: If WKCTSEN (LPUART_WKCTL[0]) is enabled, the nCTS wake-up cause this bit set to '1'.
     * |        |          |Note 2: This bit can be cleared by writing '1' to it.
     * |[1]     |DATWKF    |Incoming Data Wake-up Flag
     * |        |          |This bit is set if chip wake-up from power-down state by data wake-up.
     * |        |          |0 = Chip stays in power-down state.
     * |        |          |1 = Chip wake-up from power-down state by Incoming Data wake-up.
     * |        |          |Note 1: If WKDATEN (LPUART_WKCTL[1]) is enabled, the Incoming Data wake-up cause this bit set to '1'.
     * |        |          |Note 2: This bit can be cleared by writing '1' to it.
     * |[2]     |RFRTWKF   |Received Data FIFO Reached Threshold Wake-up Flag
     * |        |          |This bit is set if chip wake-up from power-down state by Received Data FIFO reached threshold wake-up.
     * |        |          |0 = Chip stays in power-down state.
     * |        |          |1 = Chip wake-up from power-down state by Received Data FIFO Reached Threshold wake-up.
     * |        |          |Note 1: If WKRFRTEN (LPUART_WKCTL[2]) is enabled, the Received Data FIFO Reached Threshold wake-up cause this bit set to '1'.
     * |        |          |Note 2: This bit can be cleared by writing '1' to it.
     * |[3]     |RS485WKF  |RS-485 Address Match (AAD Mode) Wake-up Flag
     * |        |          |This bit is set if chip wake-up from power-down state by RS-485 Address Match (AAD mode).
     * |        |          |0 = Chip stays in power-down state.
     * |        |          |1 = Chip wake-up from power-down state by RS-485 Address Match (AAD mode) wake-up.
     * |        |          |Note 1: If WKRS485EN (LPUART_WKCTL[3]) is enabled, the RS-485 Address Match (AAD mode) wake-up cause this bit set to '1'.
     * |        |          |Note 2: This bit can be cleared by writing '1' to it.
     * |[4]     |TOUTWKF   |Received Data FIFO Threshold Time-out Wake-up Flag
     * |        |          |This bit is set if chip wake-up from power-down state by Received Data FIFO Threshold Time-out wake-up.
     * |        |          |0 = Chip stays in power-down state.
     * |        |          |1 = Chip wake-up from power-down state by Received Data FIFO reached threshold time-out.
     * |        |          |Note 1: If WKTOUTEN (LPUART_WKCTL[4]) is enabled, the Received Data FIFO reached threshold time-out wake-up cause this bit set to '1'.
     * |        |          |Note 2: This bit can be cleared by writing '1' to it.
     * @var LPUART_T::DWKCOMP
     * Offset: 0x48  LPUART Incoming Data Wake-up Compensation Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |STCOMP    |START Bit Compensation Value
     * |        |          |These bits field indicate how many clock cycle selected by LPUART_CLK do the LPUART controller can get the 1st bit (START bit) when the device is wake-up from power-down mode.
     * |        |          |Note: It is valid only when WKDATEN (LPUART_WKCTL[1]) is set.
     * @var LPUART_T::RS485DD
     * Offset: 0x4C  LPUART RS485 Transceiver Deactivate Delay Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |RTSDDLY   |RS485 Transceiver Deactivate Delay Value
     * |        |          |These bits field indicate how many clock cycles selected by LPUART_CLK do the LPUART controller delay the RS485 transceiver state trancing when the state trancing of RS485 transceiver is from TX to RX state.
     * |        |          |These bits field have no effect when the state trancing of RS485 transceiver is from RX to TX state.
     * |        |          |Note: It is valid only when RS485AUD (LPUART_ALTCTL[10]) is set.
     * @var LPUART_T::AUTOCTL
     * Offset: 0x58  LPUART Automatic Operation Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |TRIGSEL   |Automatic Operation Trigger Source Select
     * |        |          |0000 = Low Power Auto-operation Trigger Source from LPTMR0.
     * |        |          |0001 = Low Power Auto-operation Trigger Source from LPTMR1.
     * |        |          |0010 = Low Power Auto-operation Trigger Source from TTMR0.
     * |        |          |0011 = Low Power Auto-operation Trigger Source from TTMR1.
     * |        |          |0100 = Low Power Auto-operation Trigger Source from WKIOA0.
     * |        |          |0101 = Low Power Auto-operation Trigger Source from WKIOB0.
     * |        |          |0110 = Low Power Auto-operation Trigger Source from WKIOC0.
     * |        |          |0111 = Low Power Auto-operation Trigger Source from WKIOD0.
     * |        |          |1000~1111 = Reserved.
     * |[4]     |TRIGEN    |Automatic Operation Trigger Enable Bit
     * |        |          |When TRIGEN (LPUART_AUTOCTL[4]) is set to '1', the automatic TX operation of LPUART will be triggered by an event sent from the trigger source selected by TRIGSEL[3:0].
     * |        |          |0 = LPUART Automatic Operation Trigger disabled.
     * |        |          |1 = LPUART Automatic Operation Trigger enabled.
     * |[5]     |CKAWOEN   |Automatic Operation Clock Always-on Enable Bit
     * |        |          |0 = Automatic Operation Clock Always-on Disabled.
     * |        |          |1 = Automatic Operation Clock Always-on Enabled.
     * |[8]     |WKAOTOEN  |Bus Idle Time-out Wake-up Enable Bit
     * |        |          |0 = Bus Idle Time-out Wake-up system function Disabled.
     * |        |          |1 = Bus Idle Time-out Wake-up system function Enabled.
     * |        |          |Note 1: When the system is in Power-down mode, Bus Idle Time-out event will wake-up system from Power-down mode if WKAOTOEN (LPUART_AUTOCTL[8]), AOEN (LPUART_AUTOCTL[31]), and TOCNTEN (LPUART_INTEN[11]) are all set to '1'.
     * |        |          |Note 2: When WKAOTOEN (LPUART_AUTOCTL[8]) is reset to '0', Bus Idle Time-out Wake-up event will not wake up the system
     * |        |          |Moreover, Bus Idle Time-out Wake-up event will gate the UART clock off if WKAOTOEN (LPUART_AUTOCTL[8]) and TRIGEN (LPUART_AUTOCTL[4]) are both reset to '0'.
     * |[9]     |SWTRIG    |Software Trigger (Write Only)
     * |        |          |After AOEN is set to 1, software can manually trigger the automatic TX operation by writing 1 to this bit.
     * |[31]    |AOEN      |Automatic Operation Enable Bit
     * |        |          |0 = Automatic Operation Disabled.
     * |        |          |1 = Automatic Operation Enabled.
     * @var LPUART_T::AUTOSTS
     * Offset: 0x5C  LPUART Automatic Operation Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |AOTOWKF   |Bus Idle Time-out Wake-up Flag
     * |        |          |This bit is set if chip wake-up from power-down state by Bus Idle Time-out Wake-up
     * |        |          |0 = There is no Bus Idle Time-out Wake-up event.
     * |        |          |1 = Chip wake-up from power-down state by Bus Idle Time-out Wake-up.
     * |        |          |Note 1: When RXPDMAEN (LPUART_INTEN[15]) or TXPDMAEN (LPUART_INTEN[14]) is enabled, this bit is the shadow bit of HWTOIF (LPUART_INTSTS[20]);
     * |        |          |user can read/clear it by reading/resetting HWTOIF (LPUART_INTSTS[20]) or AOTOWKF (LPUART_AUTOSTS[0]).
     * |        |          |Note 2: When RXPDMAEN (LPUART_INTEN[15]) and TXPDMAEN (LPUART_INTEN[14]) are both disabled, this bit is the shadow bit of RXTOIF (LPUART_INTSTS[4]);
     * |        |          |user can read/clear it by reading/resetting RXTOIF (LPUART_INTSTS[4]) or AOTOWKF (LPUART_AUTOSTS[0]).
     * |        |          |Note 3: If WKAOTOEN (LPUART_AUTOCTL[8]) is enabled, the Bus Idle Time-out Wake-up event will set this bit.
     * |        |          |Note 4: This bit can be cleared by writing '1' to it.
     */
    __IO uint32_t DAT;                   /*!< [0x0000] LPUART Receive/Transmit Buffer Register                          */
    __IO uint32_t INTEN;                 /*!< [0x0004] LPUART Interrupt Enable Register                                 */
    __IO uint32_t FIFO;                  /*!< [0x0008] LPUART FIFO Control Register                                     */
    __IO uint32_t LINE;                  /*!< [0x000c] LPUART Line Control Register                                     */
    __IO uint32_t MODEM;                 /*!< [0x0010] LPUART Modem Control Register                                    */
    __IO uint32_t MODEMSTS;              /*!< [0x0014] LPUART Modem Status Register                                     */
    __IO uint32_t FIFOSTS;               /*!< [0x0018] LPUART FIFO Status Register                                      */
    __IO uint32_t INTSTS;                /*!< [0x001c] LPUART Interrupt Status Register                                 */
    __IO uint32_t TOUT;                  /*!< [0x0020] LPUART Time-out Register                                         */
    __IO uint32_t BAUD;                  /*!< [0x0024] LPUART Baud Rate Divider Register                                */
    __IO uint32_t RESERVE0[1];
    __IO uint32_t ALTCTL;                /*!< [0x002c] LPUART Alternate Control/Status Register                         */
    __IO uint32_t FUNCSEL;               /*!< [0x0030] LPUART Function Select Register                                  */
    __IO uint32_t RESERVE1[2];
    __IO uint32_t BRCOMP;                /*!< [0x003c] LPUART Baud Rate Compensation Register                           */
    __IO uint32_t WKCTL;                 /*!< [0x0040] LPUART Wake-up Control Register                                  */
    __IO uint32_t WKSTS;                 /*!< [0x0044] LPUART Wake-up Status Register                                   */
    __IO uint32_t DWKCOMP;               /*!< [0x0048] LPUART Incoming Data Wake-up Compensation Register               */
    __IO uint32_t RS485DD;               /*!< [0x004c] LPUART RS485 Transceiver Deactivate Delay Register               */
    __I  uint32_t RESERVE2[2];
    __IO uint32_t AUTOCTL;               /*!< [0x0058] LPUART Automatic Operation Control Register                      */
    __IO uint32_t AUTOSTS;               /*!< [0x005c] LPUART Automatic Operation Status Register                       */

} LPUART_T;

/**
    @addtogroup LPUART_CONST LPUART Bit Field Definition
    Constant Definitions for LPUART Controller
@{ */

