zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpuart_reg.h
#define LPUART_DAT_DAT_Pos               (0)                                               /*!< LPUART_T::DAT: DAT Position            */
#define LPUART_DAT_DAT_Msk               (0xfful << LPUART_DAT_DAT_Pos)                    /*!< LPUART_T::DAT: DAT Mask                */

#define LPUART_DAT_PARITY_Pos            (8)                                               /*!< LPUART_T::DAT: PARITY Position         */
#define LPUART_DAT_PARITY_Msk            (0x1ul << LPUART_DAT_PARITY_Pos)                  /*!< LPUART_T::DAT: PARITY Mask             */

#define LPUART_INTEN_RDAIEN_Pos          (0)                                               /*!< LPUART_T::INTEN: RDAIEN Position       */
#define LPUART_INTEN_RDAIEN_Msk          (0x1ul << LPUART_INTEN_RDAIEN_Pos)                /*!< LPUART_T::INTEN: RDAIEN Mask           */

#define LPUART_INTEN_THREIEN_Pos         (1)                                               /*!< LPUART_T::INTEN: THREIEN Position      */
#define LPUART_INTEN_THREIEN_Msk         (0x1ul << LPUART_INTEN_THREIEN_Pos)               /*!< LPUART_T::INTEN: THREIEN Mask          */

#define LPUART_INTEN_RLSIEN_Pos          (2)                                               /*!< LPUART_T::INTEN: RLSIEN Position       */
#define LPUART_INTEN_RLSIEN_Msk          (0x1ul << LPUART_INTEN_RLSIEN_Pos)                /*!< LPUART_T::INTEN: RLSIEN Mask           */

#define LPUART_INTEN_MODEMIEN_Pos        (3)                                               /*!< LPUART_T::INTEN: MODEMIEN Position     */
#define LPUART_INTEN_MODEMIEN_Msk        (0x1ul << LPUART_INTEN_MODEMIEN_Pos)              /*!< LPUART_T::INTEN: MODEMIEN Mask         */

#define LPUART_INTEN_RXTOIEN_Pos         (4)                                               /*!< LPUART_T::INTEN: RXTOIEN Position      */
#define LPUART_INTEN_RXTOIEN_Msk         (0x1ul << LPUART_INTEN_RXTOIEN_Pos)               /*!< LPUART_T::INTEN: RXTOIEN Mask          */

#define LPUART_INTEN_BUFERRIEN_Pos       (5)                                               /*!< LPUART_T::INTEN: BUFERRIEN Position    */
#define LPUART_INTEN_BUFERRIEN_Msk       (0x1ul << LPUART_INTEN_BUFERRIEN_Pos)             /*!< LPUART_T::INTEN: BUFERRIEN Mask        */

#define LPUART_INTEN_WKIEN_Pos           (6)                                               /*!< LPUART_T::INTEN: WKIEN Position        */
#define LPUART_INTEN_WKIEN_Msk           (0x1ul << LPUART_INTEN_WKIEN_Pos)                 /*!< LPUART_T::INTEN: WKIEN Mask            */

#define LPUART_INTEN_TOCNTEN_Pos         (11)                                              /*!< LPUART_T::INTEN: TOCNTEN Position      */
#define LPUART_INTEN_TOCNTEN_Msk         (0x1ul << LPUART_INTEN_TOCNTEN_Pos)               /*!< LPUART_T::INTEN: TOCNTEN Mask          */

#define LPUART_INTEN_ATORTSEN_Pos        (12)                                              /*!< LPUART_T::INTEN: ATORTSEN Position     */
#define LPUART_INTEN_ATORTSEN_Msk        (0x1ul << LPUART_INTEN_ATORTSEN_Pos)              /*!< LPUART_T::INTEN: ATORTSEN Mask         */

#define LPUART_INTEN_ATOCTSEN_Pos        (13)                                              /*!< LPUART_T::INTEN: ATOCTSEN Position     */
#define LPUART_INTEN_ATOCTSEN_Msk        (0x1ul << LPUART_INTEN_ATOCTSEN_Pos)              /*!< LPUART_T::INTEN: ATOCTSEN Mask         */

#define LPUART_INTEN_TXPDMAEN_Pos        (14)                                              /*!< LPUART_T::INTEN: TXPDMAEN Position     */
#define LPUART_INTEN_TXPDMAEN_Msk        (0x1ul << LPUART_INTEN_TXPDMAEN_Pos)              /*!< LPUART_T::INTEN: TXPDMAEN Mask         */

#define LPUART_INTEN_RXPDMAEN_Pos        (15)                                              /*!< LPUART_T::INTEN: RXPDMAEN Position     */
#define LPUART_INTEN_RXPDMAEN_Msk        (0x1ul << LPUART_INTEN_RXPDMAEN_Pos)              /*!< LPUART_T::INTEN: RXPDMAEN Mask         */

#define LPUART_INTEN_ABRIEN_Pos          (18)                                              /*!< LPUART_T::INTEN: ABRIEN Position       */
#define LPUART_INTEN_ABRIEN_Msk          (0x1ul << LPUART_INTEN_ABRIEN_Pos)                /*!< LPUART_T::INTEN: ABRIEN Mask           */

#define LPUART_INTEN_TXENDIEN_Pos        (22)                                              /*!< LPUART_T::INTEN: TXENDIEN Position     */
#define LPUART_INTEN_TXENDIEN_Msk        (0x1ul << LPUART_INTEN_TXENDIEN_Pos)              /*!< LPUART_T::INTEN: TXENDIEN Mask         */

#define LPUART_FIFO_RXRST_Pos            (1)                                               /*!< LPUART_T::FIFO: RXRST Position         */
#define LPUART_FIFO_RXRST_Msk            (0x1ul << LPUART_FIFO_RXRST_Pos)                  /*!< LPUART_T::FIFO: RXRST Mask             */

#define LPUART_FIFO_TXRST_Pos            (2)                                               /*!< LPUART_T::FIFO: TXRST Position         */
#define LPUART_FIFO_TXRST_Msk            (0x1ul << LPUART_FIFO_TXRST_Pos)                  /*!< LPUART_T::FIFO: TXRST Mask             */

#define LPUART_FIFO_RFITL_Pos            (4)                                               /*!< LPUART_T::FIFO: RFITL Position         */
#define LPUART_FIFO_RFITL_Msk            (0xful << LPUART_FIFO_RFITL_Pos)                  /*!< LPUART_T::FIFO: RFITL Mask             */

#define LPUART_FIFO_RXOFF_Pos            (8)                                               /*!< LPUART_T::FIFO: RXOFF Position         */
#define LPUART_FIFO_RXOFF_Msk            (0x1ul << LPUART_FIFO_RXOFF_Pos)                  /*!< LPUART_T::FIFO: RXOFF Mask             */

#define LPUART_FIFO_RTSTRGLV_Pos         (16)                                              /*!< LPUART_T::FIFO: RTSTRGLV Position      */
#define LPUART_FIFO_RTSTRGLV_Msk         (0xful << LPUART_FIFO_RTSTRGLV_Pos)               /*!< LPUART_T::FIFO: RTSTRGLV Mask          */

#define LPUART_LINE_WLS_Pos              (0)                                               /*!< LPUART_T::LINE: WLS Position           */
#define LPUART_LINE_WLS_Msk              (0x3ul << LPUART_LINE_WLS_Pos)                    /*!< LPUART_T::LINE: WLS Mask               */

