zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpuart_reg.h
#define LPUART_LINE_NSB_Pos              (2)                                               /*!< LPUART_T::LINE: NSB Position           */
#define LPUART_LINE_NSB_Msk              (0x1ul << LPUART_LINE_NSB_Pos)                    /*!< LPUART_T::LINE: NSB Mask               */

#define LPUART_LINE_PBE_Pos              (3)                                               /*!< LPUART_T::LINE: PBE Position           */
#define LPUART_LINE_PBE_Msk              (0x1ul << LPUART_LINE_PBE_Pos)                    /*!< LPUART_T::LINE: PBE Mask               */

#define LPUART_LINE_EPE_Pos              (4)                                               /*!< LPUART_T::LINE: EPE Position           */
#define LPUART_LINE_EPE_Msk              (0x1ul << LPUART_LINE_EPE_Pos)                    /*!< LPUART_T::LINE: EPE Mask               */

#define LPUART_LINE_SPE_Pos              (5)                                               /*!< LPUART_T::LINE: SPE Position           */
#define LPUART_LINE_SPE_Msk              (0x1ul << LPUART_LINE_SPE_Pos)                    /*!< LPUART_T::LINE: SPE Mask               */

#define LPUART_LINE_BCB_Pos              (6)                                               /*!< LPUART_T::LINE: BCB Position           */
#define LPUART_LINE_BCB_Msk              (0x1ul << LPUART_LINE_BCB_Pos)                    /*!< LPUART_T::LINE: BCB Mask               */

#define LPUART_LINE_PSS_Pos              (7)                                               /*!< LPUART_T::LINE: PSS Position           */
#define LPUART_LINE_PSS_Msk              (0x1ul << LPUART_LINE_PSS_Pos)                    /*!< LPUART_T::LINE: PSS Mask               */

#define LPUART_LINE_TXDINV_Pos           (8)                                               /*!< LPUART_T::LINE: TXDINV Position        */
#define LPUART_LINE_TXDINV_Msk           (0x1ul << LPUART_LINE_TXDINV_Pos)                 /*!< LPUART_T::LINE: TXDINV Mask            */

#define LPUART_LINE_RXDINV_Pos           (9)                                               /*!< LPUART_T::LINE: RXDINV Position        */
#define LPUART_LINE_RXDINV_Msk           (0x1ul << LPUART_LINE_RXDINV_Pos)                 /*!< LPUART_T::LINE: RXDINV Mask            */

#define LPUART_MODEM_RTS_Pos             (1)                                               /*!< LPUART_T::MODEM: RTS Position          */
#define LPUART_MODEM_RTS_Msk             (0x1ul << LPUART_MODEM_RTS_Pos)                   /*!< LPUART_T::MODEM: RTS Mask              */

#define LPUART_MODEM_LOOKBACK_Pos        (4)                                               /*!< LPUART_T::MODEM: LOOKBACK Position     */
#define LPUART_MODEM_LOOKBACK_Msk        (0x1ul << LPUART_MODEM_LOOKBACK_Pos)              /*!< LPUART_T::MODEM: LOOKBACK Mask         */

#define LPUART_MODEM_RTSACTLV_Pos        (9)                                               /*!< LPUART_T::MODEM: RTSACTLV Position     */
#define LPUART_MODEM_RTSACTLV_Msk        (0x1ul << LPUART_MODEM_RTSACTLV_Pos)              /*!< LPUART_T::MODEM: RTSACTLV Mask         */

#define LPUART_MODEM_RTSSTS_Pos          (13)                                              /*!< LPUART_T::MODEM: RTSSTS Position       */
#define LPUART_MODEM_RTSSTS_Msk          (0x1ul << LPUART_MODEM_RTSSTS_Pos)                /*!< LPUART_T::MODEM: RTSSTS Mask           */

#define LPUART_MODEMSTS_CTSDETF_Pos      (0)                                               /*!< LPUART_T::MODEMSTS: CTSDETF Position   */
#define LPUART_MODEMSTS_CTSDETF_Msk      (0x1ul << LPUART_MODEMSTS_CTSDETF_Pos)            /*!< LPUART_T::MODEMSTS: CTSDETF Mask       */

#define LPUART_MODEMSTS_CTSSTS_Pos       (4)                                               /*!< LPUART_T::MODEMSTS: CTSSTS Position    */
#define LPUART_MODEMSTS_CTSSTS_Msk       (0x1ul << LPUART_MODEMSTS_CTSSTS_Pos)             /*!< LPUART_T::MODEMSTS: CTSSTS Mask        */

#define LPUART_MODEMSTS_CTSACTLV_Pos     (8)                                               /*!< LPUART_T::MODEMSTS: CTSACTLV Position  */
#define LPUART_MODEMSTS_CTSACTLV_Msk     (0x1ul << LPUART_MODEMSTS_CTSACTLV_Pos)           /*!< LPUART_T::MODEMSTS: CTSACTLV Mask      */

#define LPUART_FIFOSTS_RXOVIF_Pos        (0)                                               /*!< LPUART_T::FIFOSTS: RXOVIF Position     */
#define LPUART_FIFOSTS_RXOVIF_Msk        (0x1ul << LPUART_FIFOSTS_RXOVIF_Pos)              /*!< LPUART_T::FIFOSTS: RXOVIF Mask         */

#define LPUART_FIFOSTS_ABRDIF_Pos        (1)                                               /*!< LPUART_T::FIFOSTS: ABRDIF Position     */
#define LPUART_FIFOSTS_ABRDIF_Msk        (0x1ul << LPUART_FIFOSTS_ABRDIF_Pos)              /*!< LPUART_T::FIFOSTS: ABRDIF Mask         */

#define LPUART_FIFOSTS_ABRDTOIF_Pos      (2)                                               /*!< LPUART_T::FIFOSTS: ABRDTOIF Position   */
#define LPUART_FIFOSTS_ABRDTOIF_Msk      (0x1ul << LPUART_FIFOSTS_ABRDTOIF_Pos)            /*!< LPUART_T::FIFOSTS: ABRDTOIF Mask       */

#define LPUART_FIFOSTS_ADDRDETF_Pos      (3)                                               /*!< LPUART_T::FIFOSTS: ADDRDETF Position   */
#define LPUART_FIFOSTS_ADDRDETF_Msk      (0x1ul << LPUART_FIFOSTS_ADDRDETF_Pos)            /*!< LPUART_T::FIFOSTS: ADDRDETF Mask       */

#define LPUART_FIFOSTS_PEF_Pos           (4)                                               /*!< LPUART_T::FIFOSTS: PEF Position        */
#define LPUART_FIFOSTS_PEF_Msk           (0x1ul << LPUART_FIFOSTS_PEF_Pos)                 /*!< LPUART_T::FIFOSTS: PEF Mask            */

#define LPUART_FIFOSTS_FEF_Pos           (5)                                               /*!< LPUART_T::FIFOSTS: FEF Position        */
#define LPUART_FIFOSTS_FEF_Msk           (0x1ul << LPUART_FIFOSTS_FEF_Pos)                 /*!< LPUART_T::FIFOSTS: FEF Mask            */

#define LPUART_FIFOSTS_BIF_Pos           (6)                                               /*!< LPUART_T::FIFOSTS: BIF Position        */
#define LPUART_FIFOSTS_BIF_Msk           (0x1ul << LPUART_FIFOSTS_BIF_Pos)                 /*!< LPUART_T::FIFOSTS: BIF Mask            */

