zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpuart_reg.h
#define LPUART_FIFOSTS_RXPTR_Pos         (8)                                               /*!< LPUART_T::FIFOSTS: RXPTR Position      */
#define LPUART_FIFOSTS_RXPTR_Msk         (0x3ful << LPUART_FIFOSTS_RXPTR_Pos)              /*!< LPUART_T::FIFOSTS: RXPTR Mask          */

#define LPUART_FIFOSTS_RXEMPTY_Pos       (14)                                              /*!< LPUART_T::FIFOSTS: RXEMPTY Position    */
#define LPUART_FIFOSTS_RXEMPTY_Msk       (0x1ul << LPUART_FIFOSTS_RXEMPTY_Pos)             /*!< LPUART_T::FIFOSTS: RXEMPTY Mask        */

#define LPUART_FIFOSTS_RXFULL_Pos        (15)                                              /*!< LPUART_T::FIFOSTS: RXFULL Position     */
#define LPUART_FIFOSTS_RXFULL_Msk        (0x1ul << LPUART_FIFOSTS_RXFULL_Pos)              /*!< LPUART_T::FIFOSTS: RXFULL Mask         */

#define LPUART_FIFOSTS_TXPTR_Pos         (16)                                              /*!< LPUART_T::FIFOSTS: TXPTR Position      */
#define LPUART_FIFOSTS_TXPTR_Msk         (0x3ful << LPUART_FIFOSTS_TXPTR_Pos)              /*!< LPUART_T::FIFOSTS: TXPTR Mask          */

#define LPUART_FIFOSTS_TXEMPTY_Pos       (22)                                              /*!< LPUART_T::FIFOSTS: TXEMPTY Position    */
#define LPUART_FIFOSTS_TXEMPTY_Msk       (0x1ul << LPUART_FIFOSTS_TXEMPTY_Pos)             /*!< LPUART_T::FIFOSTS: TXEMPTY Mask        */

#define LPUART_FIFOSTS_TXFULL_Pos        (23)                                              /*!< LPUART_T::FIFOSTS: TXFULL Position     */
#define LPUART_FIFOSTS_TXFULL_Msk        (0x1ul << LPUART_FIFOSTS_TXFULL_Pos)              /*!< LPUART_T::FIFOSTS: TXFULL Mask         */

#define LPUART_FIFOSTS_TXOVIF_Pos        (24)                                              /*!< LPUART_T::FIFOSTS: TXOVIF Position     */
#define LPUART_FIFOSTS_TXOVIF_Msk        (0x1ul << LPUART_FIFOSTS_TXOVIF_Pos)              /*!< LPUART_T::FIFOSTS: TXOVIF Mask         */

#define LPUART_FIFOSTS_TXEMPTYF_Pos      (28)                                              /*!< LPUART_T::FIFOSTS: TXEMPTYF Position   */
#define LPUART_FIFOSTS_TXEMPTYF_Msk      (0x1ul << LPUART_FIFOSTS_TXEMPTYF_Pos)            /*!< LPUART_T::FIFOSTS: TXEMPTYF Mask       */

#define LPUART_FIFOSTS_RXIDLE_Pos        (29)                                              /*!< LPUART_T::FIFOSTS: RXIDLE Position     */
#define LPUART_FIFOSTS_RXIDLE_Msk        (0x1ul << LPUART_FIFOSTS_RXIDLE_Pos)              /*!< LPUART_T::FIFOSTS: RXIDLE Mask         */

#define LPUART_FIFOSTS_TXRXACT_Pos       (31)                                              /*!< LPUART_T::FIFOSTS: TXRXACT Position    */
#define LPUART_FIFOSTS_TXRXACT_Msk       (0x1ul << LPUART_FIFOSTS_TXRXACT_Pos)             /*!< LPUART_T::FIFOSTS: TXRXACT Mask        */

#define LPUART_INTSTS_RDAIF_Pos          (0)                                               /*!< LPUART_T::INTSTS: RDAIF Position       */
#define LPUART_INTSTS_RDAIF_Msk          (0x1ul << LPUART_INTSTS_RDAIF_Pos)                /*!< LPUART_T::INTSTS: RDAIF Mask           */

#define LPUART_INTSTS_THREIF_Pos         (1)                                               /*!< LPUART_T::INTSTS: THREIF Position      */
#define LPUART_INTSTS_THREIF_Msk         (0x1ul << LPUART_INTSTS_THREIF_Pos)               /*!< LPUART_T::INTSTS: THREIF Mask          */

#define LPUART_INTSTS_RLSIF_Pos          (2)                                               /*!< LPUART_T::INTSTS: RLSIF Position       */
#define LPUART_INTSTS_RLSIF_Msk          (0x1ul << LPUART_INTSTS_RLSIF_Pos)                /*!< LPUART_T::INTSTS: RLSIF Mask           */

#define LPUART_INTSTS_MODEMIF_Pos        (3)                                               /*!< LPUART_T::INTSTS: MODEMIF Position     */
#define LPUART_INTSTS_MODEMIF_Msk        (0x1ul << LPUART_INTSTS_MODEMIF_Pos)              /*!< LPUART_T::INTSTS: MODEMIF Mask         */

#define LPUART_INTSTS_RXTOIF_Pos         (4)                                               /*!< LPUART_T::INTSTS: RXTOIF Position      */
#define LPUART_INTSTS_RXTOIF_Msk         (0x1ul << LPUART_INTSTS_RXTOIF_Pos)               /*!< LPUART_T::INTSTS: RXTOIF Mask          */

#define LPUART_INTSTS_BUFERRIF_Pos       (5)                                               /*!< LPUART_T::INTSTS: BUFERRIF Position    */
#define LPUART_INTSTS_BUFERRIF_Msk       (0x1ul << LPUART_INTSTS_BUFERRIF_Pos)             /*!< LPUART_T::INTSTS: BUFERRIF Mask        */

#define LPUART_INTSTS_WKIF_Pos           (6)                                               /*!< LPUART_T::INTSTS: WKIF Position        */
#define LPUART_INTSTS_WKIF_Msk           (0x1ul << LPUART_INTSTS_WKIF_Pos)                 /*!< LPUART_T::INTSTS: WKIF Mask            */

#define LPUART_INTSTS_RDAINT_Pos         (8)                                               /*!< LPUART_T::INTSTS: RDAINT Position      */
#define LPUART_INTSTS_RDAINT_Msk         (0x1ul << LPUART_INTSTS_RDAINT_Pos)               /*!< LPUART_T::INTSTS: RDAINT Mask          */

#define LPUART_INTSTS_THREINT_Pos        (9)                                               /*!< LPUART_T::INTSTS: THREINT Position     */
#define LPUART_INTSTS_THREINT_Msk        (0x1ul << LPUART_INTSTS_THREINT_Pos)              /*!< LPUART_T::INTSTS: THREINT Mask         */

#define LPUART_INTSTS_RLSINT_Pos         (10)                                              /*!< LPUART_T::INTSTS: RLSINT Position      */
#define LPUART_INTSTS_RLSINT_Msk         (0x1ul << LPUART_INTSTS_RLSINT_Pos)               /*!< LPUART_T::INTSTS: RLSINT Mask          */

#define LPUART_INTSTS_MODEMINT_Pos       (11)                                              /*!< LPUART_T::INTSTS: MODEMINT Position    */
#define LPUART_INTSTS_MODEMINT_Msk       (0x1ul << LPUART_INTSTS_MODEMINT_Pos)             /*!< LPUART_T::INTSTS: MODEMINT Mask        */

#define LPUART_INTSTS_RXTOINT_Pos        (12)                                              /*!< LPUART_T::INTSTS: RXTOINT Position     */
#define LPUART_INTSTS_RXTOINT_Msk        (0x1ul << LPUART_INTSTS_RXTOINT_Pos)              /*!< LPUART_T::INTSTS: RXTOINT Mask         */

#define LPUART_INTSTS_BUFERRINT_Pos      (13)                                              /*!< LPUART_T::INTSTS: BUFERRINT Position   */
#define LPUART_INTSTS_BUFERRINT_Msk      (0x1ul << LPUART_INTSTS_BUFERRINT_Pos)            /*!< LPUART_T::INTSTS: BUFERRINT Mask       */

#define LPUART_INTSTS_WKINT_Pos          (14)                                              /*!< LPUART_T::INTSTS: WKINT Position       */
#define LPUART_INTSTS_WKINT_Msk          (0x1ul << LPUART_INTSTS_WKINT_Pos)                /*!< LPUART_T::INTSTS: WKINT Mask           */

#define LPUART_INTSTS_HWRLSIF_Pos        (18)                                              /*!< LPUART_T::INTSTS: HWRLSIF Position     */
#define LPUART_INTSTS_HWRLSIF_Msk        (0x1ul << LPUART_INTSTS_HWRLSIF_Pos)              /*!< LPUART_T::INTSTS: HWRLSIF Mask         */

#define LPUART_INTSTS_HWMODIF_Pos        (19)                                              /*!< LPUART_T::INTSTS: HWMODIF Position     */
#define LPUART_INTSTS_HWMODIF_Msk        (0x1ul << LPUART_INTSTS_HWMODIF_Pos)              /*!< LPUART_T::INTSTS: HWMODIF Mask         */

#define LPUART_INTSTS_HWTOIF_Pos         (20)                                              /*!< LPUART_T::INTSTS: HWTOIF Position      */
#define LPUART_INTSTS_HWTOIF_Msk         (0x1ul << LPUART_INTSTS_HWTOIF_Pos)               /*!< LPUART_T::INTSTS: HWTOIF Mask          */

