zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpuart_reg.h
#define LPUART_INTSTS_HWBUFEIF_Pos       (21)                                              /*!< LPUART_T::INTSTS: HWBUFEIF Position    */
#define LPUART_INTSTS_HWBUFEIF_Msk       (0x1ul << LPUART_INTSTS_HWBUFEIF_Pos)             /*!< LPUART_T::INTSTS: HWBUFEIF Mask        */

#define LPUART_INTSTS_TXENDIF_Pos        (22)                                              /*!< LPUART_T::INTSTS: TXENDIF Position     */
#define LPUART_INTSTS_TXENDIF_Msk        (0x1ul << LPUART_INTSTS_TXENDIF_Pos)              /*!< LPUART_T::INTSTS: TXENDIF Mask         */

#define LPUART_INTSTS_HWRLSINT_Pos       (26)                                              /*!< LPUART_T::INTSTS: HWRLSINT Position    */
#define LPUART_INTSTS_HWRLSINT_Msk       (0x1ul << LPUART_INTSTS_HWRLSINT_Pos)             /*!< LPUART_T::INTSTS: HWRLSINT Mask        */

#define LPUART_INTSTS_HWMODINT_Pos       (27)                                              /*!< LPUART_T::INTSTS: HWMODINT Position    */
#define LPUART_INTSTS_HWMODINT_Msk       (0x1ul << LPUART_INTSTS_HWMODINT_Pos)             /*!< LPUART_T::INTSTS: HWMODINT Mask        */

#define LPUART_INTSTS_HWTOINT_Pos        (28)                                              /*!< LPUART_T::INTSTS: HWTOINT Position     */
#define LPUART_INTSTS_HWTOINT_Msk        (0x1ul << LPUART_INTSTS_HWTOINT_Pos)              /*!< LPUART_T::INTSTS: HWTOINT Mask         */

#define LPUART_INTSTS_HWBUFEINT_Pos      (29)                                              /*!< LPUART_T::INTSTS: HWBUFEINT Position   */
#define LPUART_INTSTS_HWBUFEINT_Msk      (0x1ul << LPUART_INTSTS_HWBUFEINT_Pos)            /*!< LPUART_T::INTSTS: HWBUFEINT Mask       */

#define LPUART_INTSTS_TXENDINT_Pos       (30)                                              /*!< LPUART_T::INTSTS: TXENDINT Position    */
#define LPUART_INTSTS_TXENDINT_Msk       (0x1ul << LPUART_INTSTS_TXENDINT_Pos)             /*!< LPUART_T::INTSTS: TXENDINT Mask        */

#define LPUART_INTSTS_ABRINT_Pos         (31)                                              /*!< LPUART_T::INTSTS: ABRINT Position      */
#define LPUART_INTSTS_ABRINT_Msk         (0x1ul << LPUART_INTSTS_ABRINT_Pos)               /*!< LPUART_T::INTSTS: ABRINT Mask          */

#define LPUART_TOUT_TOIC_Pos             (0)                                               /*!< LPUART_T::TOUT: TOIC Position          */
#define LPUART_TOUT_TOIC_Msk             (0xfful << LPUART_TOUT_TOIC_Pos)                  /*!< LPUART_T::TOUT: TOIC Mask              */

#define LPUART_TOUT_DLY_Pos              (8)                                               /*!< LPUART_T::TOUT: DLY Position           */
#define LPUART_TOUT_DLY_Msk              (0xfful << LPUART_TOUT_DLY_Pos)                   /*!< LPUART_T::TOUT: DLY Mask               */

#define LPUART_TOUT_BITOMEN_Pos          (31)                                              /*!< LPUART_T::TOUT: BITOMEN Position       */
#define LPUART_TOUT_BITOMEN_Msk          (0x1ul << LPUART_TOUT_BITOMEN_Pos)                /*!< LPUART_T::TOUT: BITOMEN Mask           */

#define LPUART_BAUD_BRD_Pos              (0)                                               /*!< LPUART_T::BAUD: BRD Position           */
#define LPUART_BAUD_BRD_Msk              (0xfffful << LPUART_BAUD_BRD_Pos)                 /*!< LPUART_T::BAUD: BRD Mask               */

#define LPUART_BAUD_EDIVM1_Pos           (24)                                              /*!< LPUART_T::BAUD: EDIVM1 Position        */
#define LPUART_BAUD_EDIVM1_Msk           (0xful << LPUART_BAUD_EDIVM1_Pos)                 /*!< LPUART_T::BAUD: EDIVM1 Mask            */

#define LPUART_BAUD_BAUDM0_Pos           (28)                                              /*!< LPUART_T::BAUD: BAUDM0 Position        */
#define LPUART_BAUD_BAUDM0_Msk           (0x1ul << LPUART_BAUD_BAUDM0_Pos)                 /*!< LPUART_T::BAUD: BAUDM0 Mask            */

#define LPUART_BAUD_BAUDM1_Pos           (29)                                              /*!< LPUART_T::BAUD: BAUDM1 Position        */
#define LPUART_BAUD_BAUDM1_Msk           (0x1ul << LPUART_BAUD_BAUDM1_Pos)                 /*!< LPUART_T::BAUD: BAUDM1 Mask            */

#define LPUART_ALTCTL_RS485NMM_Pos       (8)                                               /*!< LPUART_T::ALTCTL: RS485NMM Position    */
#define LPUART_ALTCTL_RS485NMM_Msk       (0x1ul << LPUART_ALTCTL_RS485NMM_Pos)             /*!< LPUART_T::ALTCTL: RS485NMM Mask        */

#define LPUART_ALTCTL_RS485AAD_Pos       (9)                                               /*!< LPUART_T::ALTCTL: RS485AAD Position    */
#define LPUART_ALTCTL_RS485AAD_Msk       (0x1ul << LPUART_ALTCTL_RS485AAD_Pos)             /*!< LPUART_T::ALTCTL: RS485AAD Mask        */

#define LPUART_ALTCTL_RS485AUD_Pos       (10)                                              /*!< LPUART_T::ALTCTL: RS485AUD Position    */
#define LPUART_ALTCTL_RS485AUD_Msk       (0x1ul << LPUART_ALTCTL_RS485AUD_Pos)             /*!< LPUART_T::ALTCTL: RS485AUD Mask        */

#define LPUART_ALTCTL_ADDRDEN_Pos        (15)                                              /*!< LPUART_T::ALTCTL: ADDRDEN Position     */
#define LPUART_ALTCTL_ADDRDEN_Msk        (0x1ul << LPUART_ALTCTL_ADDRDEN_Pos)              /*!< LPUART_T::ALTCTL: ADDRDEN Mask         */

#define LPUART_ALTCTL_ABRIF_Pos          (17)                                              /*!< LPUART_T::ALTCTL: ABRIF Position       */
#define LPUART_ALTCTL_ABRIF_Msk          (0x1ul << LPUART_ALTCTL_ABRIF_Pos)                /*!< LPUART_T::ALTCTL: ABRIF Mask           */

#define LPUART_ALTCTL_ABRDEN_Pos         (18)                                              /*!< LPUART_T::ALTCTL: ABRDEN Position      */
#define LPUART_ALTCTL_ABRDEN_Msk         (0x1ul << LPUART_ALTCTL_ABRDEN_Pos)               /*!< LPUART_T::ALTCTL: ABRDEN Mask          */

#define LPUART_ALTCTL_ABRDBITS_Pos       (19)                                              /*!< LPUART_T::ALTCTL: ABRDBITS Position    */
#define LPUART_ALTCTL_ABRDBITS_Msk       (0x3ul << LPUART_ALTCTL_ABRDBITS_Pos)             /*!< LPUART_T::ALTCTL: ABRDBITS Mask        */

