zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/lpuart_reg.h
#define LPUART_ALTCTL_ADDRMV_Pos         (24)                                              /*!< LPUART_T::ALTCTL: ADDRMV Position      */
#define LPUART_ALTCTL_ADDRMV_Msk         (0xfful << LPUART_ALTCTL_ADDRMV_Pos)              /*!< LPUART_T::ALTCTL: ADDRMV Mask          */

#define LPUART_FUNCSEL_FUNCSEL_Pos       (0)                                               /*!< LPUART_T::FUNCSEL: FUNCSEL Position    */
#define LPUART_FUNCSEL_FUNCSEL_Msk       (0x7ul << LPUART_FUNCSEL_FUNCSEL_Pos)             /*!< LPUART_T::FUNCSEL: FUNCSEL Mask        */

#define LPUART_FUNCSEL_TXRXDIS_Pos       (3)                                               /*!< LPUART_T::FUNCSEL: TXRXDIS Position    */
#define LPUART_FUNCSEL_TXRXDIS_Msk       (0x1ul << LPUART_FUNCSEL_TXRXDIS_Pos)             /*!< LPUART_T::FUNCSEL: TXRXDIS Mask        */

#define LPUART_FUNCSEL_DGE_Pos           (6)                                               /*!< LPUART_T::FUNCSEL: DGE Position        */
#define LPUART_FUNCSEL_DGE_Msk           (0x1ul << LPUART_FUNCSEL_DGE_Pos)                 /*!< LPUART_T::FUNCSEL: DGE Mask            */

#define LPUART_FUNCSEL_TXRXSWP_Pos       (7)                                               /*!< LPUART_T::FUNCSEL: TXRXSWP Position    */
#define LPUART_FUNCSEL_TXRXSWP_Msk       (0x1ul << LPUART_FUNCSEL_TXRXSWP_Pos)             /*!< LPUART_T::FUNCSEL: TXRXSWP Mask        */

#define LPUART_BRCOMP_BRCOMP_Pos         (0)                                               /*!< LPUART_T::BRCOMP: BRCOMP Position      */
#define LPUART_BRCOMP_BRCOMP_Msk         (0x1fful << LPUART_BRCOMP_BRCOMP_Pos)             /*!< LPUART_T::BRCOMP: BRCOMP Mask          */

#define LPUART_BRCOMP_BRCOMPDEC_Pos      (31)                                              /*!< LPUART_T::BRCOMP: BRCOMPDEC Position   */
#define LPUART_BRCOMP_BRCOMPDEC_Msk      (0x1ul << LPUART_BRCOMP_BRCOMPDEC_Pos)            /*!< LPUART_T::BRCOMP: BRCOMPDEC Mask       */

#define LPUART_WKCTL_WKCTSEN_Pos         (0)                                               /*!< LPUART_T::WKCTL: WKCTSEN Position      */
#define LPUART_WKCTL_WKCTSEN_Msk         (0x1ul << LPUART_WKCTL_WKCTSEN_Pos)               /*!< LPUART_T::WKCTL: WKCTSEN Mask          */

#define LPUART_WKCTL_WKDATEN_Pos         (1)                                               /*!< LPUART_T::WKCTL: WKDATEN Position      */
#define LPUART_WKCTL_WKDATEN_Msk         (0x1ul << LPUART_WKCTL_WKDATEN_Pos)               /*!< LPUART_T::WKCTL: WKDATEN Mask          */

#define LPUART_WKCTL_WKRFRTEN_Pos        (2)                                               /*!< LPUART_T::WKCTL: WKRFRTEN Position     */
#define LPUART_WKCTL_WKRFRTEN_Msk        (0x1ul << LPUART_WKCTL_WKRFRTEN_Pos)              /*!< LPUART_T::WKCTL: WKRFRTEN Mask         */

#define LPUART_WKCTL_WKRS485EN_Pos       (3)                                               /*!< LPUART_T::WKCTL: WKRS485EN Position    */
#define LPUART_WKCTL_WKRS485EN_Msk       (0x1ul << LPUART_WKCTL_WKRS485EN_Pos)             /*!< LPUART_T::WKCTL: WKRS485EN Mask        */

#define LPUART_WKCTL_WKTOUTEN_Pos        (4)                                               /*!< LPUART_T::WKCTL: WKTOUTEN Position     */
#define LPUART_WKCTL_WKTOUTEN_Msk        (0x1ul << LPUART_WKCTL_WKTOUTEN_Pos)              /*!< LPUART_T::WKCTL: WKTOUTEN Mask         */

#define LPUART_WKSTS_CTSWKF_Pos          (0)                                               /*!< LPUART_T::WKSTS: CTSWKF Position       */
#define LPUART_WKSTS_CTSWKF_Msk          (0x1ul << LPUART_WKSTS_CTSWKF_Pos)                /*!< LPUART_T::WKSTS: CTSWKF Mask           */

#define LPUART_WKSTS_DATWKF_Pos          (1)                                               /*!< LPUART_T::WKSTS: DATWKF Position       */
#define LPUART_WKSTS_DATWKF_Msk          (0x1ul << LPUART_WKSTS_DATWKF_Pos)                /*!< LPUART_T::WKSTS: DATWKF Mask           */

#define LPUART_WKSTS_RFRTWKF_Pos         (2)                                               /*!< LPUART_T::WKSTS: RFRTWKF Position      */
#define LPUART_WKSTS_RFRTWKF_Msk         (0x1ul << LPUART_WKSTS_RFRTWKF_Pos)               /*!< LPUART_T::WKSTS: RFRTWKF Mask          */

#define LPUART_WKSTS_RS485WKF_Pos        (3)                                               /*!< LPUART_T::WKSTS: RS485WKF Position     */
#define LPUART_WKSTS_RS485WKF_Msk        (0x1ul << LPUART_WKSTS_RS485WKF_Pos)              /*!< LPUART_T::WKSTS: RS485WKF Mask         */

#define LPUART_WKSTS_TOUTWKF_Pos         (4)                                               /*!< LPUART_T::WKSTS: TOUTWKF Position      */
#define LPUART_WKSTS_TOUTWKF_Msk         (0x1ul << LPUART_WKSTS_TOUTWKF_Pos)               /*!< LPUART_T::WKSTS: TOUTWKF Mask          */

#define LPUART_DWKCOMP_STCOMP_Pos        (0)                                               /*!< LPUART_T::DWKCOMP: STCOMP Position     */
#define LPUART_DWKCOMP_STCOMP_Msk        (0xfffful << LPUART_DWKCOMP_STCOMP_Pos)           /*!< LPUART_T::DWKCOMP: STCOMP Mask         */

#define LPUART_RS485DD_RTSDDLY_Pos       (0)                                               /*!< LPUART_T::RS485DD: RTSDDLY Position    */
#define LPUART_RS485DD_RTSDDLY_Msk       (0xfffful << LPUART_RS485DD_RTSDDLY_Pos)          /*!< LPUART_T::RS485DD: RTSDDLY Mask        */

#define LPUART_AUTOCTL_TRIGSEL_Pos       (0)                                               /*!< LPUART_T::AUTOCTL: TRIGSEL Position    */
#define LPUART_AUTOCTL_TRIGSEL_Msk       (0xful << LPUART_AUTOCTL_TRIGSEL_Pos)             /*!< LPUART_T::AUTOCTL: TRIGSEL Mask        */

#define LPUART_AUTOCTL_TRIGEN_Pos        (4)                                               /*!< LPUART_T::AUTOCTL: TRIGEN Position     */
#define LPUART_AUTOCTL_TRIGEN_Msk        (0x1ul << LPUART_AUTOCTL_TRIGEN_Pos)              /*!< LPUART_T::AUTOCTL: TRIGEN Mask         */

#define LPUART_AUTOCTL_CKAWOEN_Pos       (5)                                               /*!< LPUART_T::AUTOCTL: CKAWOEN Position    */
#define LPUART_AUTOCTL_CKAWOEN_Msk       (0x1ul << LPUART_AUTOCTL_CKAWOEN_Pos)             /*!< LPUART_T::AUTOCTL: CKAWOEN Mask        */

#define LPUART_AUTOCTL_WKAOTOEN_Pos      (8)                                               /*!< LPUART_T::AUTOCTL: WKAOTOEN Position   */
#define LPUART_AUTOCTL_WKAOTOEN_Msk      (0x1ul << LPUART_AUTOCTL_WKAOTOEN_Pos)            /*!< LPUART_T::AUTOCTL: WKAOTOEN Mask       */

#define LPUART_AUTOCTL_SWTRIG_Pos        (9)                                               /*!< LPUART_T::AUTOCTL: SWTRIG Position     */
#define LPUART_AUTOCTL_SWTRIG_Msk        (0x1ul << LPUART_AUTOCTL_SWTRIG_Pos)              /*!< LPUART_T::AUTOCTL: SWTRIG Mask         */

#define LPUART_AUTOCTL_AOEN_Pos          (31)                                              /*!< LPUART_T::AUTOCTL: AOEN Position       */
#define LPUART_AUTOCTL_AOEN_Msk          (0x1ul << LPUART_AUTOCTL_AOEN_Pos)                /*!< LPUART_T::AUTOCTL: AOEN Mask           */

#define LPUART_AUTOSTS_AOTOWKF_Pos       (0)                                               /*!< LPUART_T::AUTOSTS: AOTOWKF Position    */
#define LPUART_AUTOSTS_AOTOWKF_Msk       (0x1ul << LPUART_AUTOSTS_AOTOWKF_Pos)             /*!< LPUART_T::AUTOSTS: AOTOWKF Mask        */

/** @} LPUART_CONST */
/** @} end of LPUART register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __LPUART_REG_H__ */
